In [17]:
import pandas as pd

data = {
    'Department': ['HR', 'IT', 'HR', 'Finance', 'IT', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace'],
    'Salary': [50000, 60000, 55000, 70000, 65000, 72000, 52000]
}

df = pd.DataFrame(data)
print(df)

  Department Employee  Salary
0         HR    Alice   50000
1         IT      Bob   60000
2         HR  Charlie   55000
3    Finance    David   70000
4         IT      Eve   65000
5    Finance    Frank   72000
6         HR    Grace   52000

In [18]:
#  Grouping with groupby()
# a) Group by Department and get total salary:
df.groupby('Department')['Salary'].sum()
df

  Department Employee  Salary
0         HR    Alice   50000
1         IT      Bob   60000
2         HR  Charlie   55000
3    Finance    David   70000
4         IT      Eve   65000
5    Finance    Frank   72000
6         HR    Grace   52000

In [19]:
# Group by Department and get average salary:
df.groupby('Department')['Salary'].mean()

Department
Finance    71000.000000
HR         52333.333333
IT         62500.000000
Name: Salary, dtype: float64

In [20]:
df.groupby('Department')['Salary'].agg(['mean', 'sum', 'count'])

                    mean     sum  count
Department
Finance     71000.000000  142000      2
HR          52333.333333  157000      3
IT          62500.000000  125000      2

In [21]:
# 3. What is Sorting?
# You can sort your data using sort_values() or sort_index()

df.sort_values(by='Salary')

  Department Employee  Salary
0         HR    Alice   50000
6         HR    Grace   52000
2         HR  Charlie   55000
1         IT      Bob   60000
4         IT      Eve   65000
3    Finance    David   70000
5    Finance    Frank   72000

In [22]:
# b) Sort by Salary (descending):
df.sort_values(by='Salary', ascending=False)

  Department Employee  Salary
5    Finance    Frank   72000
3    Finance    David   70000
4         IT      Eve   65000
1         IT      Bob   60000
2         HR  Charlie   55000
6         HR    Grace   52000
0         HR    Alice   50000

In [23]:
# 4. Combine Grouping and Sorting
# a) Sort departments by average salary:

In [24]:
# Sort departments by average salary:

df.groupby('Department')['Salary'].mean().sort_values(ascending=False)

Department
Finance    71000.000000
IT         62500.000000
HR         52333.333333
Name: Salary, dtype: float64

In [25]:
# Sort within each group (e.g., sort employees by salary within department):

df.sort_values(by=['Department', 'Salary'], ascending=[True, False])
df

  Department Employee  Salary
0         HR    Alice   50000
1         IT      Bob   60000
2         HR  Charlie   55000
3    Finance    David   70000
4         IT      Eve   65000
5    Finance    Frank   72000
6         HR    Grace   52000

In [26]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Score': [85, 92, 78]
}

df = pd.DataFrame(data, index=['b', 'a', 'c'])

print("Original DataFrame:")
print(df)

print("\nSorted by index:")
print(df.sort_index())

Original DataFrame:
      Name  Score
b    Alice     85
a      Bob     92
c  Charlie     78

Sorted by index:
      Name  Score
a      Bob     92
b    Alice     85
c  Charlie     78

In [27]:
# Sorting in Descending Order 

df.sort_index(ascending=False)

      Name  Score
c  Charlie     78
b    Alice     85
a      Bob     92

In [28]:
# Sorting Columns by Index (Axis=1)
# You can also use sort_index(axis=1) to sort the columns alphabetically.

df2 = pd.DataFrame({
    'B': [3, 2],
    'A': [1, 4],
    'C': [5, 6]
}, index=['y', 'x'])

df2


# axis = 0 means sort row - wise
print(df2.sort_index(axis=0)) 

# axis = 1 means sort col - wise

print(df2.sort_index(axis=1))

   B  A  C
x  2  4  6
y  3  1  5
   A  B  C
y  1  3  5
x  4  2  6